<?php
require('Censure.class.php');

function testIsBad($title, $text, $check) {
    $start = microtime(true);
    $result = Censure::is_bad($text);
    echo $title . " (". $text. ") is_bad: ";
    var_dump($result);
    $end = microtime(true);
    echo "time: " . number_format(microtime(true) - $start, 10) . "\n";
    return !!($check === $result);
}

function testReplace($title, $text, $check) {
    echo $title . " (". $text. ") is_bad: ";
    $start = microtime(true);
    $result = Censure::replace($text);
    echo "replace: " . $result . "\n";
    $end = microtime(true);
    echo "time: " . number_format(microtime(true) - $start, 10) . "\n";
    return !!($check === $result);
}

function test($title, $text, $isBad, $replace) {
    if (testIsBad($title, $text, $isBad) && testReplace($title, $text, $replace)) {
        echo "test is passed! V\n\n";
    } else {
        echo "test is not passed! X\n\n";
    }
}

// 0 Backward compatibility (Анальная)
// is_bad: bool(true)
// replace: ***
test('0 Backward compatibility', 'Анальная', true, '***');

// 1 A (Анальная, анус, анусе) 
// is_bad: bool(true)
// replace: *** *** ***
test('1 A', 
'Анальная, анус, анусе', true, '***, ***, ***');

// 2 Б (Бздун, бздит, бля, блядская, блядь)
// is_bad: bool(true)
// replace: *** *** *** *** ***
test('2 Б', 
'Бздун, бздит, бля, блядская, блядь', true, '***, ***, ***, ***, ***');

// 3 Ваф (Вафел, вафлер / вафлЁр, вафлерка / вафлёрка, вафлеглот, вафлист, вафлили, вафлисткие вафли)
// is_bad: bool(true)
// replace: ***, *** / ***, *** / ***, ***, ***, ***, *** вафли
test('3 Ваф', 
'Вафел, вафлер / вафлЁр, вафлерка / вафлёрка, вафлеглот, вафлист, вафлили, вафлисткие вафли', true, 
'***, *** / ***, *** / ***, ***, ***, ***, *** вафли');

// 4 Вман - Вмуд (Вмандиться, вмандякаться, вмандячиться, вмандохаться, вмандошиться, вмандяшиться, вмандяхаться, вмандюриться, вмандяриться, вмудохаться)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('4 Вман - Вмуд',
'Вмандиться, вмандякаться, вмандячиться, вмандохаться, вмандошиться, вмандяшиться, вмандяхаться, вмандюриться, вмандяриться, вмудохаться', true,
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 5 Во - Впи (Вошка, ядрена вошь, мондавошка, впендюривали, впизду / в пизду, вздрочнул / вздрачил)
// is_bad: bool(true)
// replace: ***, *** ***, ***, ***, *** / в ***, *** / ***
test('5 Во - Впи', 
'Вошка, ядрена вошь, мондавошка, впендюривали, впизду / в пизду, вздрочнул / вздрачил', true,
'***, *** ***, ***, ***, *** / в ***, *** / ***');

// 6 Впи (Впиздрониться, впиздячиться, впиздюриться, впиздохаться, впиздошиться, впиздюлиться, впиздяриться, впиздюхаться, впиздяхаться, впиздяшиться)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('6 Впи', 
'Впиздрониться, впиздячиться, впиздюриться, впиздохаться, впиздошиться, впиздюлиться, впиздяриться, впиздюхаться, впиздяхаться, впиздяшиться', true,
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 7 Вху (Вхуяриться, вхуякаться, вхуячиться, вхуйнуться)
// is_bad: bool(true)
// replace: ***, ***, ***, ***
test('7 Вху', 
'Вхуяриться, вхуякаться, вхуячиться, вхуйнуться', true, '***, ***, ***, ***');

// 8 Въеб (Въебаться, въебениться, въебёхаться / въебехаться, въебуриться, в ебеню феню)
// is_bad: bool(true)
// replace: ***, ***, *** / ***, ***, в *** феню
test('8 Въеб', 
'Въебаться, въебениться, въебёхаться / въебехаться, въебуриться, в ебеню феню', true, 
'***, ***, *** / ***, ***, в *** феню');

// 9 Вы (Высер, мегавысер)
// is_bad: bool(true)
// replace: ***, ***
test('9 Вы', 'Высер, мегавысер', true, '***, ***');

// 10 Гов (Говном, говно-люди, говна, говница, говенных, говнище, говенный)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***
test('10 Гов', 
'Говном, говно-люди, говна, говница, говенных, говнище, говенный', true, 
'***, ***, ***, ***, ***, ***, ***');

// 11 Гол (Голощелка, гомик, гомиков, гомосятина, гондон, гумозник)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***
test('11 Гол', 
'Голощелка, гомик, гомиков, гомосятина, гондон, гумозник', true, 
'***, ***, ***, ***, ***, ***');

// 12 Дав - Дол (Давалка, даваха, дерьмовая, дилдо, додик, доебизм, дойки, долбаная, долбежка, долбоебов)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('12 Дав - Дол', 
'Давалка, даваха, дерьмовая, дилдо, додик, доебизм, дойки, долбаная, долбежка, долбоебов', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 13 Доп - Доус (Допиздишься, дососать, досасывая, доснашиваясь, досношаться, досикать, досикивать, досирать, доусеру, доусрачки)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('13 Доп - Доус',
'Допиздишься, дососать, досасывая, доснашиваясь, досношаться, досикать, досикивать, досирать, доусеру, доусрачки', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 14 Дри - Дуп (Дристополет, обдристать, дрочка, драчильня, задрочили, дрючить, дуплиться)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***
test('14 Дри - Дуп',
'Дристополет, обдристать, дрочка, драчильня, задрочили, дрючить, дуплиться', true, 
'***, ***, ***, ***, ***, ***, ***');

// 15 Е (Ебанько, ебеня, ебеня, еблан, ебнутая, ерепениться, eдрёная, едрить, ерундовая, ёбнутая)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('15 Е',
'Ебанько, ебеня, ебеня, еблан, ебнутая, ерепениться, eдрёная, едрить, ерундовая, ёбнутая', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 16 Ж (Жид, жидовская, жопа, жопянная, жопник, жопочник, жопошник)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('16 Ж',
'Жид, жидовская, жопа, жопянная, жопник, жопочник, жопошник', true, 
'***, ***, ***, ***, ***, ***, ***');

// 17 Заб - Зас (Забулдыга, загадить, зад, задница, задрот, задротище, заноза, зануда, зараза, засранец)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('17 Заб - Зас',
'Забулдыга, загадить, зад, задница, задрот, задротище, заноза, зануда, зараза, засранец', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 18 Зас - Зат (Засранка, засеря, затычка)
// is_bad: bool(true)
// replace: ***, ***, ***
test('18 Зас - Зат',
'Засранка, засеря, затычка', true, '***, ***, ***');

// 19 И (Идиот, идиотка, измандякаться, йух)
// is_bad: bool(true)
// replace: ***, ***, ***, ***
test('19 И',
'Идиот, идиотка, измандякаться, йух', true, '***, ***, ***, ***');

// 20 К (Карга, клитор, кобель, кобелина, кретин, курва)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***
test('20 К',
'Карга, клитор, кобель, кобелина, кретин, курва', true, 
'***, ***, ***, ***, ***, ***');

// 21 Л (Лох, лохушка, лахудра, легавый, лупоглазый)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***
test('21 Л',
'Лох, лохушка, лахудра, легавый, лупоглазый', true, '***, ***, ***, ***, ***');

// 22 Ман - Муд (Мандавошка, манда, монда, мондавошка, маразматик, мегера, мент, мерзавец, мразь, мудак)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('22 Ман - Муд',
'Мандавошка, манда, монда, мондавошка, маразматик, мегера, мент, мерзавец, мразь, мудак', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 23 Муд (Мудило, мудила, мудозвон, мудохаться)
// is_bad: bool(true)
// replace: ***, ***, ***, ***
test('23 Муд',
'Мудило, мудила, мудозвон, мудохаться', true, '***, ***, ***, ***');

// 24 Н (Наёбка, наебали, ничтожество)
// is_bad: bool(true)
// replace: ***, ***, ***
test('24 Н',
'Наёбка, наебали, ничтожество', true, '***, ***, ***');

// 25 О (Обалдуй, обосранец, обосраться, образина, остолоп, отребье, отродье, охуенчик)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***
test('25 О',
'Обалдуй, обосранец, обосраться, образина, остолоп, отребье, отродье, охуенчик', true, 
'***, ***, ***, ***, ***, ***, ***, ***');

// 26 Па - Пиз (Падаль, падла, паскуда, паскудный, потаскуха, паразит, пентюх, перечниа, пиздатая, пизда)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('26 Па - Пиз',
'Падаль, падла, паскуда, паскудный, потаскуха, паразит, пентюх, перечниа, пиздатая, пизда', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 27 Под - Про (Подонок, подстилка, позорник, порнуха, полудурок, потаскун, потаскуха, придурок, прихвостень, прорва)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('27 Под - Про',
'Подонок, подстилка, позорник, порнуха, полудурок, потаскун, потаскуха, придурок, прихвостень, прорва', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 28 Про - Пьянь (Пройдоха, проститутка, прохвост, прохиндей, проходимец, пустобрёх, пустозвон, пустомеля, пьянчуга, пьянь)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('28 Про - Пьянь',
'Пройдоха, проститутка, прохвост, прохиндей, проходимец, пустобрёх, пустозвон, пустомеля, пьянчуга, пьянь', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 29 Р (Разъебать, раздолбай, распиздяйство, рвань, ренегат, рогоносец)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***
test('29 Р',
'Разъебать, раздолбай, распиздяйство, рвань, ренегат, рогоносец', true, 
'***, ***, ***, ***, ***, ***');

// 30 С (Сволочь, соси, сосать, срать, ссать, стерва, сука, сукин, сучка)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***
test('30 С',
'Сволочь, соси, сосать, срать, ссать, стерва, сука, сукин, сучка', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***');

// 31 Т (Тварь, тёлка, толстозадый, тошнотворное, трахать, трепотня, тряпка, тупица, тупоголовый, туполобый, тупоумный, тягомотину)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('31 Т',
'Тварь, тёлка, толстозадый, тошнотворное, трахать, трепотня, тряпка, тупица, тупоголовый, туполобый, тупоумный, тягомотину', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 32 У (Ублюдок, ублюдошный, уебан, уебище, урод, уродка)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***
test('32 У',
'Ублюдок, ублюдошный, уебан, уебище, урод, уродка', true, 
'***, ***, ***, ***, ***, ***');

// 33 Ф (Фаллос, фефёлка, фофан, фуфло, фуфлогон)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***
test('33 Ф',
'Фаллос, фефёлка, фофан, фуфло, фуфлогон', true, '***, ***, ***, ***, ***');

// 34 Ха - ху (Хайло, халда, хлюст, хмырь, холуй, холуйство, холуйствуют, хрен, хреновина, хуй)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***, ***
test('34 Ха - ху',
'Хайло, халда, хлюст, хмырь, холуй, холуйство, холуйствуют, хрен, хреновина, хуй', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***, ***');

// 35 Ху - Хр (Хуя, дохуя, нахера, охуеть, хуячить, хуярить, хуяк-хуяк, хуле, хрыч)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***, ***
test('35 Ху - Хр',
'Хуя, дохуя, нахера, охуеть, хуячить, хуярить, хуяк-хуяк, хуле, хрыч', true, 
'***, ***, ***, ***, ***, ***, ***, ***, ***');

// 36 Ц - Ч (Целка, черножопый, чернозадый, черномазый, чинодрал, чмо, чурбан, чучело)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***, ***
test('36 Ц - Ч',
'Целка, черножопый, чернозадый, черномазый, чинодрал, чмо, чурбан, чучело', true, 
'***, ***, ***, ***, ***, ***, ***, ***');

// 37 Ш (Шваль, шалава, шалашовка, шантрапа, шизоид, шлюха, шлюшка)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***
test('37 Ш',
'Шваль, шалава, шалашовка, шантрапа, шизоид, шлюха, шлюшка', true, 
'***, ***, ***, ***, ***, ***, ***');

// 38 Щ - Я (Щекотильник, эрекция, юлда, юлдак, ядрёна, ядрена, ядрить)
// is_bad: bool(true)
// replace: ***, ***, ***, ***, ***, ***, ***
test('38 Щ - Я',
'Щекотильник, эрекция, юлда, юлдак, ядрёна, ядрена, ядрить', true, 
'***, ***, ***, ***, ***, ***, ***');