<?php
namespace Censure\patterns;

class PatternsRu
{
    /**
	 * Set an array of russian abusive words
	 */
    public static $patterns = array(
    'анал[а-я]+|анус|анус[а-я]+',
    'бзд[а-я]+', 'бля|бля[а-я]+',
    'вафел|вафлер|вафлёр|вафлер[а-я]+|вафлёр[а-я]+|вафле[а-я]+|вафлист|вафли[а-я]+|вафлист[а-я]+',
    'вошка|вошь', 'вздроч[а-я]+|вздрач[а-я]+',
    'вманд[а-я]+|вмуд[а-я]+',
    'впенд[а-я]+|впиз[а-я]+|пиз[а-я]+',
    'вхуя[а-я]+|вхуй[а-я]+|вхуй[а-я]+',
    'въеб[а-я]+|въебё[а-я]+|выеб[а-я]+|выёб[а-я]+',
    'высер|[а-я]+высер',
    'говн[а-я]+|говен[а-я]+|говён[а-я]+',
    'голощелка', 'гомос[а-я]+|гомик[а-я]+|гомик', 'гондон|гондон[а-я]+', 'гумозник',
    'давалка|даваха', 'дерьм[а-я]+', 'дилдо', 'додик', 'доеб[а-я]+', 'дойки', 'долбан[а-я]+|долбежка|долбоеб[а-я]+',
    'допиз[а-я]+', 'досос[а-я]+|досас[а-я]+', 'доснашив[а-я]+|доснош[а-я]+', 'досикат[а-я]+|досикив[а-я]+', 'досир[а-я]+|доусеру|доусрач[а-я]+',
    'дрист[а-я]+|[а-я]+дрис[а-я]+', 'дроч[а-я]+|драч[а-я]+|[а-я]+дроч[а-я]+|дрюч[а-я]+', 'дуплиться',
    'еба[а-я]+', 'ебеня|ебен[а-я]+', 'ебл[а-я]+', 'ебнут[а-я]+', 'ерепени[а-я]+', 'eдрёна[а-я]+|едрить|едрить[а-я]+', 'елда', 'ерунд[а-я]+', 'ёб[а-я]+',
    'жид|жид[а-я]+', 'жопа|жоп[а-я]+|жопник|жопочник|жопошник',
    'забулдыга', 'загадить', 'зад|задница', 'задрот|задрот[а-я]+', 'заноза', 'зануда', 'зараза',
    'засранец|засран[а-я]+|засеря', 'затычка',
    'идиот|идиот[а-я]+', 'изманд[а-я]+', 'йух',
    'карга', 'клитор', 'кобель|кобел[а-я]+', 'кретин', 'курва',
    'лох|лох[а-я]+', 'лахудра', 'легавый', 'лупоглазый',
    'манд[а-я]+|манда|монда|монда[а-я]+', 'маразматик', 'мегера', 'мент', 'мерзавец', 'мразь',
    'мудак|мудило|мудил[а-я]+|мудозвон|мудох[а-я]+',
    'наёб[а-я]+|наеб[а-я]+', 'ничтожество',
    'обалдуй', 'обосранец|обосра[а-я]+', 'образина', 'остолоп', 'отребье|отрепье', 'отродье', 'охуе[а-я]+',
    'падаль|падла', 'паскуда|паскудный', 'потаскуха', 'паразит', 'пентюх', 'перечница',
    'пизд[а-я]+|пизда|[а-я]+пизд[а-я]+',
    'подонок', 'подстилка', 'позорник', 'порнуха', 'полудурок', 'потаскун|потаскуха', 'придурок', 'прихвостень', 'прорва',
    'пройдоха', 'проститутка', 'прохвост', 'прохиндей', 'проходимец', 'пустобрёх|пустозвон|пустомеля', 'пьянчуга|пьянь',
    'разъеб[а-я]+', 'раздолбай', 'распизд[а-я]+', 'рвань', 'ренегат', 'рогоносец',
    'сброд', 'сволочь', 'соси|соса[а-я]+', 'срать', 'ссать', 'стерва', 'сука|сукин|сучка',
    'тварь', 'тёлка', 'толстозадый', 'тошнотворное', 'трах[ая]+', 'трепотня', 'тряпка', 'тупица|тупоголовый|туполобый|тупоумный', 'тягомотину',
    'ублюдок', 'ублюд[а-я]+', 'уеб[а-я]+', 'уебище', 'урод', 'урод[а-я]+',
    'фаллос', 'фефела|фефёла|фефёлка', 'фофан', 'фуфло|фуфл[а-я]+',
    'хайло', 'халда', '[а-я]+хера', 'хлюст', 'хмырь', 'холуй|холуйство|холуйств[а-я]+', 'хрен|хреновина', 'хрыч',
    'ху|хуй|ху[а-я]+|[а-я]+хуя', '[а-я]+ху[а-я]+', 'хуле', 'хуяк[а-я]+|хуяр[а-я]+|хуяч[а-я]+',
    'целка', 'черножопый|чернозадый|черномазый', 'чинодрал', 'чмо', 'чурбан', 'чучело',
    'шалава', 'шалашовка', 'шантрапа', 'шаромыжник', 'шваль', 'шизоид', 'шлюха|шлюш[а-я]+', 'шушера',
    'щекотильник', 'эрекция', 'юлда|юлдак', 'ядрёна|ядрена', 'ядрить'
);
}